* 42's FdF project (wireframe model)
This project aims to teach the basics of 3D graphics project in C, including window management, event handling, colors, textures, etc.
** Graphical library
To help us use the graphics of the computer, we use the MiniLibx library, which was developed internally.

* Time spent
** IN PROGRESS FdF
:PROPERTIES:
:COLUMNS:  %40ITEM(Task) %17EFFORT(Estimated Effort){:} %CLOCKSUM(Time spent)
:Effort_ALL: 0:15 0:30 0:45 1:00 2:00 3:00 4:00 5:00 6:00 7:00 8:00 9:00 10:00 11:00 12:00 13:00 14:00 15:00 16:00 17:00 18:00 19:00 20:00 21:00 22:00 23:00 24:00 25:00 26:00 27:00 28:00 29:00 30:00 31:00 32:00 33:00 34:00 35:00 36:00 37:00 38:00 39:00 40:00 41:00 42:00 43:00 44:00 45:00 46:00 47:00 48:00 49:00 50:00 51:00 52:00 53:00 54:00 55:00 56:00 57:00 58:00 59:00 60:00 61:00 62:00 63:00 64:00 65:00 66:00 67:00 68:00 69:00 70:00 71:00 72:00 73:00 74:00 75:00 76:00 77:00 78:00 79:00 80:00 81:00 82:00 83:00 84:00 85:00 86:00 87:00 88:00 89:00 90:00 91:00 92:00 93:00 94:00 95:00 96:00 97:00 98:00 99:00 100:00
:Effort:   60:00
:END:
*** CODING fdf program
:LOGBOOK:
CLOCK: [2024-05-20 Mon 19:31]--[2024-05-20 Mon 19:42] =>  0:11
CLOCK: [2024-05-20 Mon 15:14]--[2024-05-20 Mon 18:54] =>  3:40
CLOCK: [2024-05-20 Mon 11:11]--[2024-05-20 Mon 11:27] =>  0:16
CLOCK: [2024-05-20 Mon 10:07]--[2024-05-20 Mon 10:39] =>  0:32
CLOCK: [2024-05-20 Mon 08:53]--[2024-05-20 Mon 09:33] =>  0:40
CLOCK: [2024-05-17 Fri 17:45]--[2024-05-17 Fri 18:15] =>  0:30
CLOCK: [2024-05-17 Fri 16:55]--[2024-05-17 Fri 17:15] =>  0:20
CLOCK: [2024-05-17 Fri 12:30]--[2024-05-17 Fri 15:30] =>  3:00
CLOCK: [2024-05-13 Mon 18:05]--[2024-05-13 Mon 19:37] =>  1:32
:END:
**** CODE Parsing
SCHEDULED: <2024-05-21 Tue>-<2024-05-23 Thu>
*** IN PROGRESS think/test/etc
